{"<BOS>": 0, "<EOS>": 1, "<PAD>": 2, "Control_11_1": 3, "Control_11_10": 4, "Control_11_11": 5, "Control_11_12": 6, "Control_11_13": 7, "Control_11_14": 8, "Control_11_15": 9, "Control_11_2": 10, "Control_11_3": 11, "Control_11_4": 12, "Control_11_5": 13, "Control_11_6": 14, "Control_11_7": 15, "Control_11_8": 16, "Control_11_9": 17, "Control_12_0": 18, "Control_12_1": 19, "Control_12_2": 20, "Control_12_3": 21, "Note_Off_1": 22, "Note_Off_10": 23, "Note_Off_100": 24, "Note_Off_101": 25, "Note_Off_102": 26, "Note_Off_103": 27, "Note_Off_104": 28, "Note_Off_105": 29, "Note_Off_106": 30, "Note_Off_107": 31, "Note_Off_108": 32, "Note_Off_11": 33, "Note_Off_12": 34, "Note_Off_13": 35, "Note_Off_14": 36, "Note_Off_15": 37, "Note_Off_16": 38, "Note_Off_2": 39, "Note_Off_21": 40, "Note_Off_22": 41, "Note_Off_23": 42, "Note_Off_24": 43, "Note_Off_25": 44, "Note_Off_26": 45, "Note_Off_27": 46, "Note_Off_28": 47, "Note_Off_29": 48, "Note_Off_3": 49, "Note_Off_30": 50, "Note_Off_31": 51, "Note_Off_32": 52, "Note_Off_33": 53, "Note_Off_34": 54, "Note_Off_35": 55, "Note_Off_36": 56, "Note_Off_37": 57, "Note_Off_38": 58, "Note_Off_39": 59, "Note_Off_4": 60, "Note_Off_40": 61, "Note_Off_41": 62, "Note_Off_42": 63, "Note_Off_43": 64, "Note_Off_44": 65, "Note_Off_45": 66, "Note_Off_46": 67, "Note_Off_47": 68, "Note_Off_48": 69, "Note_Off_49": 70, "Note_Off_5": 71, "Note_Off_50": 72, "Note_Off_51": 73, "Note_Off_52": 74, "Note_Off_53": 75, "Note_Off_54": 76, "Note_Off_55": 77, "Note_Off_56": 78, "Note_Off_57": 79, "Note_Off_58": 80, "Note_Off_59": 81, "Note_Off_6": 82, "Note_Off_60": 83, "Note_Off_61": 84, "Note_Off_62": 85, "Note_Off_63": 86, "Note_Off_64": 87, "Note_Off_65": 88, "Note_Off_66": 89, "Note_Off_67": 90, "Note_Off_68": 91, "Note_Off_69": 92, "Note_Off_7": 93, "Note_Off_70": 94, "Note_Off_71": 95, "Note_Off_72": 96, "Note_Off_73": 97, "Note_Off_74": 98, "Note_Off_75": 99, "Note_Off_76": 100, "Note_Off_77": 101, "Note_Off_78": 102, "Note_Off_79": 103, "Note_Off_8": 104, "Note_Off_80": 105, "Note_Off_81": 106, "Note_Off_82": 107, "Note_Off_83": 108, "Note_Off_84": 109, "Note_Off_85": 110, "Note_Off_86": 111, "Note_Off_87": 112, "Note_Off_88": 113, "Note_Off_89": 114, "Note_Off_9": 115, "Note_Off_90": 116, "Note_Off_91": 117, "Note_Off_92": 118, "Note_Off_93": 119, "Note_Off_94": 120, "Note_Off_95": 121, "Note_Off_96": 122, "Note_Off_97": 123, "Note_Off_98": 124, "Note_Off_99": 125, "Note_On_1": 126, "Note_On_10": 127, "Note_On_100": 128, "Note_On_101": 129, "Note_On_102": 130, "Note_On_103": 131, "Note_On_104": 132, "Note_On_105": 133, "Note_On_106": 134, "Note_On_107": 135, "Note_On_108": 136, "Note_On_11": 137, "Note_On_12": 138, "Note_On_13": 139, "Note_On_14": 140, "Note_On_15": 141, "Note_On_16": 142, "Note_On_2": 143, "Note_On_21": 144, "Note_On_22": 145, "Note_On_23": 146, "Note_On_24": 147, "Note_On_25": 148, "Note_On_26": 149, "Note_On_27": 150, "Note_On_28": 151, "Note_On_29": 152, "Note_On_3": 153, "Note_On_30": 154, "Note_On_31": 155, "Note_On_32": 156, "Note_On_33": 157, "Note_On_34": 158, "Note_On_35": 159, "Note_On_36": 160, "Note_On_37": 161, "Note_On_38": 162, "Note_On_39": 163, "Note_On_4": 164, "Note_On_40": 165, "Note_On_41": 166, "Note_On_42": 167, "Note_On_43": 168, "Note_On_44": 169, "Note_On_45": 170, "Note_On_46": 171, "Note_On_47": 172, "Note_On_48": 173, "Note_On_49": 174, "Note_On_5": 175, "Note_On_50": 176, "Note_On_51": 177, "Note_On_52": 178, "Note_On_53": 179, "Note_On_54": 180, "Note_On_55": 181, "Note_On_56": 182, "Note_On_57": 183, "Note_On_58": 184, "Note_On_59": 185, "Note_On_6": 186, "Note_On_60": 187, "Note_On_61": 188, "Note_On_62": 189, "Note_On_63": 190, "Note_On_64": 191, "Note_On_65": 192, "Note_On_66": 193, "Note_On_67": 194, "Note_On_68": 195, "Note_On_69": 196, "Note_On_7": 197, "Note_On_70": 198, "Note_On_71": 199, "Note_On_72": 200, "Note_On_73": 201, "Note_On_74": 202, "Note_On_75": 203, "Note_On_76": 204, "Note_On_77": 205, "Note_On_78": 206, "Note_On_79": 207, "Note_On_8": 208, "Note_On_80": 209, "Note_On_81": 210, "Note_On_82": 211, "Note_On_83": 212, "Note_On_84": 213, "Note_On_85": 214, "Note_On_86": 215, "Note_On_87": 216, "Note_On_88": 217, "Note_On_89": 218, "Note_On_9": 219, "Note_On_90": 220, "Note_On_91": 221, "Note_On_92": 222, "Note_On_93": 223, "Note_On_94": 224, "Note_On_95": 225, "Note_On_96": 226, "Note_On_97": 227, "Note_On_98": 228, "Note_On_99": 229, "Program_121": 230, "Program_38": 231, "Program_80": 232, "Program_81": 233}