{"4": 3, "8": 4, "9": 5, "10": 6, "11": 7, "12": 8, "13": 9, "14": 10, "15": 11, "16": 12, "17": 13, "18": 14, "19": 15, "20": 16, "21": 17, "22": 18, "23": 19, "24": 20, "25": 21, "26": 22, "27": 23, "28": 24, "29": 25, "30": 26, "31": 27, "32": 28, "33": 29, "34": 30, "35": 31, "36": 32, "37": 33, "38": 34, "39": 35, "40": 36, "41": 37, "42": 38, "43": 39, "44": 40, "45": 41, "46": 42, "47": 43, "48": 44, "49": 45, "50": 46, "51": 47, "52": 48, "53": 49, "54": 50, "55": 51, "56": 52, "57": 53, "58": 54, "59": 55, "60": 56, "61": 57, "62": 58, "63": 59, "64": 60, "65": 61, "66": 62, "67": 63, "68": 64, "69": 65, "70": 66, "71": 67, "72": 68, "73": 69, "74": 70, "75": 71, "76": 72, "77": 73, "78": 74, "79": 75, "80": 76, "81": 77, "82": 78, "83": 79, "84": 80, "85": 81, "86": 82, "87": 83, "88": 84, "89": 85, "90": 86, "91": 87, "92": 88, "93": 89, "94": 90, "109": 91, "110": 92, "111": 93, "112": 94, "113": 95, "114": 96, "115": 97, "116": 98, "117": 99, "118": 100, "119": 101, "120": 102, "121": 103, "122": 104, "123": 105, "124": 106, "125": 107, "126": 108, "127": 109, "128": 110, "129": 111, "130": 112, "131": 113, "132": 114, "133": 115, "134": 116, "135": 117, "136": 118, "137": 119, "138": 120, "139": 121, "140": 122, "141": 123, "142": 124, "143": 125, "144": 126, "145": 127, "146": 128, "147": 129, "148": 130, "149": 131, "150": 132, "151": 133, "152": 134, "153": 135, "154": 136, "155": 137, "156": 138, "157": 139, "158": 140, "162": 141, "163": 142, "166": 143, "168": 144, "169": 145, "172": 146, "173": 147, "174": 148, "175": 149, "176": 150, "177": 151, "178": 152, "179": 153, "180": 154, "181": 155, "182": 156, "183": 157, "184": 158, "185": 159, "186": 160, "187": 161, "188": 162, "189": 163, "190": 164, "191": 165, "192": 166, "193": 167, "194": 168, "195": 169, "196": 170, "197": 171, "198": 172, "199": 173, "200": 174, "201": 175, "202": 176, "203": 177, "204": 178, "267": 179, "318": 180, "360": 181, "361": 182, "<PAD>": 0, "<BOS>": 1, "<EOS>": 2}